import json

# json_string = '''json
# {
#   "prompt": "你是一位智能评论分析专家。你的任务是判断当前评论的情感属性。0代表负向，1代表正向。请注意你的回答要严格按照如下格式进行：\n           {\n               \"label\": 0或1,\n               \"reasoning\": \"请简要给出选择该答案的原因，不超过 20 个字\",\n           }\n           如下是两个示例：\n           ---\n           评论：\n           裤子才穿了几天 一张腿 直接破了 什么质量啊 而且 掉色特别严重 手一摸 满手都是黑？\n           回答：\n           {\"label\": 0, \"reasoning\": \"对裤子质量有严重批评\"}\n           ---\n           评论：\n           质量还行，这个价位还是不错的\n           回答：\n           {\"label\": 1, \"reasoning\": \"客户认为裤子性价比高\"}\n           ---"
# }
# '''
# l = json_string.find("{")
# r = json_string.rfind("}")
# json_string2 = json_string[l: r+ 1]

json_string3 = '''
{
  "prompt": "你是一位智能评论分析专家。你的任务是判断当前评论的情感属性。0代表负向，1代表正向。请注意你的回答要严格按照如下格式进行：\\n           {\\n               \\\"label\\\": 0或1,\\n               \\\"reasoning\\\": \\\"请简要给出选择该答案的原因，不超过20个字\\\",\\n           }\\n           如下是两个示例：\\n           ---\\n           评论：\\n           裤子才穿了几天 一张腿 直接破了 什么质量啊 而且 掉色特别严重 手一摸 满手都是黑？\\n           回答：\\n           {\\\"label\\\": 0, \\\"reasoning\\\": \\\"对裤子质量有严重批评\\\"}\\n           ---\\n           评论：\\n           质量还行，这个价位还是不错的\\n           回答：\\n           {\\\"label\\\": 1, \\\"reasoning\\\": \\\"客户认为裤子性价比高\\\"}\\n           ---"
}'''

result_json = json.loads(json_string3)
print(result_json)